%生成两组各1000个具有不同均值和方差的一维高斯分布的随机数，然后统计并绘制直方图
clear;
n = 1000; % 点数
u1 = 1; u2 = 10; % 均值
sigma1 = 2; sigma2 = 10; %方差
r1 = u1 + sqrt(sigma1)*randn(n,1);
r2 = u2 + sqrt(sigma2)*randn(n,1);
figure(1); hist(r1,50);
figure(2); hist(r2,50);

% 生成三组各1000个具有不同均值矢量和协方差矩阵的二维随机矢量，并绘制出二维散点图
n = 1000; % 点数
u1 = [1 1]; u2 = [10,10]; u3 = [20,20]; %均值
sigma1 = [1 0;0 2]; sigma2 = [3 0;0 3]; sigma3 = [2 0;0 2]; %协方差矩阵
r1 = mvnrnd(u1,sigma1,n);
r2 = mvnrnd(u2,sigma2,n);
r3 = mvnrnd(u3,sigma3,n);
figure; plot(r1(:,1),r1(:,2),'+')
hold on; plot(r2(:,1),r2(:,2),'o')
hold on; plot(r3(:,1),r3(:,2),'*')

%生成五组各1000个具有不同均值矢量和协方差矩阵的三维随机矢量，并绘制它们的三维散点图
n = 1000;
u1 = [1 1 1]; u2 = [10,10,10]; u3 = [20,20,20]; u4 = [30,30,30]; u5 = [40,40,40] %均值
sigma1 = [1 0 0;0 2 0;0 0 3]; sigma2 = [1 0 0;0 2 0;0 0 3]; sigma3 = [1 0 0;0 2 0;0 0 3];
sigma4 = [1 0 0;0 2 0;0 0 3]; sigma5 = [1 0 0;0 2 0;0 0 3];
r1 = mvnrnd(u1,sigma1,n);
r2 = mvnrnd(u2,sigma2,n);
r3 = mvnrnd(u3,sigma3,n);
r4 = mvnrnd(u4,sigma4,n);
r5 = mvnrnd(u5,sigma5,n);
figure(1); plot3(r1(:,1),r1(:,2),r1(:,3),'+',...
    r2(:,1),r2(:,2),r2(:,3),'o',...
    r3(:,1),r3(:,2),r3(:,3),'*',...
    r4(:,1),r4(:,2),r4(:,3),'.',...
    r5(:,1),r5(:,2),r5(:,3),'s');
%取一二维在二维平面上画出散点图
figure(2); plot(r1(:,1),r1(:,2),'+',...
    r2(:,1),r2(:,2),'o',...
    r3(:,1),r3(:,2),'*',...
    r4(:,1),r4(:,2),'.',...
    r5(:,1),r5(:,2),'s')