clear;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%               利用PCA进行特征空间的规整化          %
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
N = 100000;
mu = [5;7]; sigma = [9 2.4; 2.4 1];
X = mvnrnd(mu,sigma,N);
subplot(2,1,1); plot(X(:,1),X(:,2),'*')
title('样本集合X的二维散点图')
m = mean(X)'; %均值向量
S = (N-1)*cov(X(:,1),X(:,2));%散布矩阵
[V,D] = eig(S); %计算散布矩阵S的特征值和特征向量
Y = zeros(2,N);
for i =1:1:N
    Y(:,i) = V'*(X(i,:)'-m); %坐标变换
end
subplot(2,1,2); plot(Y(1,:),Y(2,:),'r+')
title('样本集合Y的二维散点图')