%%%% FDA %%%%%%
%2016.04.15
clear;
%% 实验数据
w1=[0.42 -0.087 0.58 ;-0.2 -3.3 -3.4 ;1.3 -0.32 1.7 ;0.39 0.71 0.23 ;-1.6 -5.3 -0.15 ;
    -0.029 0.89 -4.7;-0.23 1.9 2.2 ;0.27 -0.3 -0.87 ;-1.9 0.76 -2.1 ;0.87 -1.0 -2.6];
w2=[-0.4 0.58 0.089; -0.31 0.27 -0.04;0.38 0.055 -0.035 ;-0.15 0.53 0.011 ;-0.35 0.47 0.034 ;
    0.17 0.69 0.1;-0.011 0.55 -0.18 ;-0.27 0.61 0.12 ;-0.065 0.49 0.0012 ;-0.12 0.054 -0.063];
w3=[0.83 1.6 -0.014;1.1 1.6 0.48 ;-0.44 -0.41 0.32 ;0.047 -0.45 1.4 ;0.28 0.35 3.1 ;
    -0.39 -0.48 0.11;0.34 -0.079 0.14 ;-0.3 -0.22 2.2 ;1.1 1.2 -0.46 ;0.18 -0.11 -0.49];
w = G_w(w2,w3); %计算最优方向矢量
% v = [1;2;-1.5];
% w = normc(v);
y2 = w'*w2';
y3 = w'*w3';
figure(1)
plot3(w2(:,1),w2(:,2),w2(:,3),'*');
hold on; plot3(w3(:,1),w3(:,2),w3(:,3),'+');
hold on; plot3([-3.5*w(1),w(1)],[-3.5*w(2),w(2)],[-3.5*w(3),w(3)]);%画直线
hold on; loc2 = w*y2; plot3(loc2(1,:),loc2(2,:),loc2(3,:),'g+');
loc3 = w*y3; plot3(loc3(1,:),loc3(2,:),loc3(3,:),'r.');
title('FDA分析示意图'); 
% title('在非最优分类空间投影结果')
%%%% 设计一维贝叶斯分类器 %%%%
m_y2 = mean(y2); m_y3 = mean(y3);
S_y2 = cov(y2); S_y3 = cov(y3);
likelihood2 = normpdf(y2(:),m_y2, sqrt(S_y2)); %似然
likelihood3 = normpdf(y2(:),m_y3, sqrt(S_y3)); 
result2 = likelihood2 - likelihood3; %因为先验概率相同，所以通过直接比较似然概率大小进行分类
likelihood2 = normpdf(y3(:),m_y2, sqrt(S_y2)); %似然
likelihood3 = normpdf(y3(:),m_y3, sqrt(S_y3));
result3 = likelihood3 - likelihood2;
